# Introduction to Pandas

We will learn how to use pandas for data analysis. Pandas as an extremely powerful python library for manipulating data, with a lot of features. To study pandas, we would go through:

* Introduction to Pandas
* Series
* DataFrames
* Missing Data
* GroupBy
* Merging,Joining,and Concatenating
* Operations
* Data Input and Output

# Series

The first main data type we will learn about for pandas is the Series data type. To use series, we must first import Pandas.

A Series is very similar to a NumPy array (in fact it is built on top of the NumPy array object). What differentiates the NumPy array from a Series, is that a Series can have axis labels, meaning it can be indexed by a label, instead of just a number location. It also doesn't need to hold numeric data, it can hold any arbitrary Python Object.

Let us look at some examples:

In [2]:
import numpy as np
import pandas as pd

### Creating a Series

You can convert a list,numpy array, or dictionary to a Series:

In [3]:
labels = ['A','I','L','Y']
my_list = [10,20,30,40]

In [4]:
pd.Series?

Init signature:
pd.Series(
    data=None,
    index=None,
    dtype: 'Dtype | None' = None,
    name=None,
    copy: 'bool | None' = None,
    fastpath: 'bool | lib.NoDefault' = <no_default>,
) -> 'None'
Docstring:
One-dimensional ndarray with axis labels (including time series).

Labels need not be unique but must be a hashable type. The object
supports both integer- and label-based indexing and provides a host of
methods for performing operations involving the index. Statistical
methods from ndarray have been overridden to automatically exclude
missing data (currently represented as NaN).

Operations between Series (+, -, /, \*, \*\*) align values based on their
associated index values-- they need not be the same length. The result
index will be the sorted union of the two indexes.

Parameters
----------
data : array-like, Iterable, dict, or scalar value
    Contains data stored in Series. If data is a dict, argument order is
    maintained.
index : array-like or Index (1d)
    Values must be hashable and have the same length as `data`.
    Non-unique index values are allowed. Will default to
    RangeIndex (0, 1, 2, ..., n) if not provided. If data is dict-like
    and index is None, then the keys in the data are used as the index. If the
    index is not None, the resulting Series is reindexed with the index values.
dtype : str, numpy.dtype, or ExtensionDtype, optional
    Data type for the output Series. If not specified, this will be
    inferred from `data`.
    See the :ref:`user guide <basics.dtypes>` for more usages.
name : Hashable, default None
    The name to give to the Series.
copy : bool, default False
    Copy input data. Only affects Series or 1d ndarray input. See examples.

Notes
-----
Please reference the :ref:`User Guide <basics.series>` for more information.

Examples
--------
Constructing Series from a dictionary with an Index specified

>>> d = {'a': 1, 'b': 2, 'c': 3}
>>> ser = pd.Series(data=d, index=['a', 'b', 'c'])
>>> ser
a   1
b   2
c   3
dtype: int64

The keys of the dictionary match with the Index values, hence the Index
values have no effect.

>>> d = {'a': 1, 'b': 2, 'c': 3}
>>> ser = pd.Series(data=d, index=['x', 'y', 'z'])
>>> ser
x   NaN
y   NaN
z   NaN
dtype: float64

Note that the Index is first build with the keys from the dictionary.
After this the Series is reindexed with the given Index values, hence we
get all NaN as a result.

Constructing Series from a list with `copy=False`.

>>> r = [1, 2]
>>> ser = pd.Series(r, copy=False)
>>> ser.iloc[0] = 999
>>> r
[1, 2]
>>> ser
0    999
1      2
dtype: int64

Due to input data type the Series has a `copy` of
the original data even though `copy=False`, so
the data is unchanged.

Constructing Series from a 1d ndarray with `copy=False`.

>>> r = np.array([1, 2])
>>> ser = pd.Series(r, copy=False)
>>> ser.iloc[0] = 999
>>> r
array([999,   2])
>>> ser
0    999
1      2
dtype: int64

Due to input data type the Series has a `view` on
the original data, so
the data is changed as well.
File:           c:\users\fadhl\appdata\local\programs\python\python312\lib\site-packages\pandas\core\series.py
Type:           type
Subclasses:     SubclassedSeries

In [5]:
pd.Series(data= [5,4,2,1])

0    5
1    4
2    2
3    1
dtype: int64

In [6]:
S1 = pd.Series(data= [5,4,2,1], index=['W','X','Y','Z'])
S1

W    5
X    4
Y    2
Z    1
dtype: int64

In [7]:
S1['Y']

2

loc is for the named index

iloc is for the position

In [8]:
S1.loc['W']

5

In [9]:
S1.iloc[3]

1

In [10]:
S1[0:3]

W    5
X    4
Y    2
dtype: int64

In [11]:
S1['W':'Y']

W    5
X    4
Y    2
dtype: int64

In [12]:
## to convert the list to a pandas series:
pd.Series(data=my_list, name = 'numbers')

0    10
1    20
2    30
3    40
Name: numbers, dtype: int64

In [13]:
## you can specify index of a pandas series
pd.Series(data=my_list ,index=labels)
## note that the same thing can be done with: pd.Series(my_list,labels)

A    10
I    20
L    30
Y    40
dtype: int64

In [14]:
array = np.array([10,20,30,40])
## to convert the array to a pandas series:
pd.Series(array)

0    10
1    20
2    30
3    40
dtype: int32

In [15]:
## we can specify the array index:
pd.Series(array,labels)

A    10
I    20
L    30
Y    40
dtype: int32

In [16]:
## we can convert a dictionary to a pandas series:
my_dict = {'A':10,'I':20,'L':30, 'Y':40}
pd.Series(my_dict)

A    10
I    20
L    30
Y    40
dtype: int64

In [17]:
## pandas series can hold different data types:
pd.Series(data=labels)

0    A
1    I
2    L
3    Y
dtype: object

## Indexing

Understanding indexing is important to use pandas series. Pandas makes use of index names or numbers to allow fast look ups of information (works like a literal dictionary).

Let's see some examples of how to grab information from a Series. Let us create two series, series1 and series2:

In [18]:
series1 = pd.Series([1,2,3,4],index = ['ADE', 'OLA','EBI', 'UTI'])
series1

ADE    1
OLA    2
EBI    3
UTI    4
dtype: int64

In [19]:
series2 = pd.Series([1,2,3,4],index=['ADE','OLA','UGO','UTI'])
series2

ADE    1
OLA    2
UGO    3
UTI    4
dtype: int64

In [20]:
series1['OLA']

2

In [21]:
series1[0]

C:\Users\fadhl\AppData\Local\Temp\ipykernel_8300\2253950659.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  series1[0]

1

In [22]:
series1 + series2

ADE    2.0
EBI    NaN
OLA    4.0
UGO    NaN
UTI    8.0
dtype: float64

# Dataframes

DataFrames are the major feature of pandas and present data in a spreadsheet format very similar to Excel. We can think of a DataFrame as a bunch of Series objects put together to share the same index. Let's us consider some examples:

In [23]:
from numpy.random import randn
np.random.seed(101)

In [24]:
randn?

Docstring:
randn(d0, d1, ..., dn)

Return a sample (or samples) from the "standard normal" distribution.

.. note::
    This is a convenience function for users porting code from Matlab,
    and wraps `standard_normal`. That function takes a
    tuple to specify the size of the output, which is consistent with
    other NumPy functions like `numpy.zeros` and `numpy.ones`.

.. note::
    New code should use the
    `~numpy.random.Generator.standard_normal`
    method of a `~numpy.random.Generator` instance instead;
    please see the :ref:`random-quick-start`.

If positive int_like arguments are provided, `randn` generates an array
of shape ``(d0, d1, ..., dn)``, filled
with random floats sampled from a univariate "normal" (Gaussian)
distribution of mean 0 and variance 1. A single float randomly sampled
from the distribution is returned if no argument is provided.

Parameters
----------
d0, d1, ..., dn : int, optional
    The dimensions of the returned array, must be non-negative.
    If no argument is given a single Python float is returned.

Returns
-------
Z : ndarray or float
    A ``(d0, d1, ..., dn)``-shaped array of floating-point samples from
    the standard normal distribution, or a single such float if
    no parameters were supplied.

See Also
--------
standard_normal : Similar, but takes a tuple as its argument.
normal : Also accepts mu and sigma arguments.
random.Generator.standard_normal: which should be used for new code.

Notes
-----
For random samples from the normal distribution with mean ``mu`` and
standard deviation ``sigma``, use::

    sigma * np.random.randn(...) + mu

Examples
--------
>>> np.random.randn()
2.1923875335537315  # random

Two-by-four array of samples from the normal distribution with
mean 3 and standard deviation 2.5:

>>> 3 + 2.5 * np.random.randn(2, 4)
array([[-4.49401501,  4.00950034, -1.81814867,  7.29718677],   # random
       [ 0.39924804,  4.68456316,  4.99394529,  4.84057254]])  # random
Type:      builtin_function_or_method

In [25]:
randn(5,1)

array([[2.70684984],
       [0.62813271],
       [0.90796945],
       [0.50382575],
       [0.65111795]])

In [26]:
pd.DataFrame?

Init signature:
pd.DataFrame(
    data=None,
    index: 'Axes | None' = None,
    columns: 'Axes | None' = None,
    dtype: 'Dtype | None' = None,
    copy: 'bool | None' = None,
) -> 'None'
Docstring:
Two-dimensional, size-mutable, potentially heterogeneous tabular data.

Data structure also contains labeled axes (rows and columns).
Arithmetic operations align on both row and column labels. Can be
thought of as a dict-like container for Series objects. The primary
pandas data structure.

Parameters
----------
data : ndarray (structured or homogeneous), Iterable, dict, or DataFrame
    Dict can contain Series, arrays, constants, dataclass or list-like objects. If
    data is a dict, column order follows insertion-order. If a dict contains Series
    which have an index defined, it is aligned by its index. This alignment also
    occurs if data is a Series or a DataFrame itself. Alignment is done on
    Series/DataFrame inputs.

    If data is a list of dicts, column order follows insertion-order.

index : Index or array-like
    Index to use for resulting frame. Will default to RangeIndex if
    no indexing information part of input data and no index provided.
columns : Index or array-like
    Column labels to use for resulting frame when data does not have them,
    defaulting to RangeIndex(0, 1, 2, ..., n). If data contains column labels,
    will perform column selection instead.
dtype : dtype, default None
    Data type to force. Only a single dtype is allowed. If None, infer.
copy : bool or None, default None
    Copy data from inputs.
    For dict data, the default of None behaves like ``copy=True``.  For DataFrame
    or 2d ndarray input, the default of None behaves like ``copy=False``.
    If data is a dict containing one or more Series (possibly of different dtypes),
    ``copy=False`` will ensure that these inputs are not copied.

    .. versionchanged:: 1.3.0

See Also
--------
DataFrame.from_records : Constructor from tuples, also record arrays.
DataFrame.from_dict : From dicts of Series, arrays, or dicts.
read_csv : Read a comma-separated values (csv) file into DataFrame.
read_table : Read general delimited file into DataFrame.
read_clipboard : Read text from clipboard into DataFrame.

Notes
-----
Please reference the :ref:`User Guide <basics.dataframe>` for more information.

Examples
--------
Constructing DataFrame from a dictionary.

>>> d = {'col1': [1, 2], 'col2': [3, 4]}
>>> df = pd.DataFrame(data=d)
>>> df
   col1  col2
0     1     3
1     2     4

Notice that the inferred dtype is int64.

>>> df.dtypes
col1    int64
col2    int64
dtype: object

To enforce a single dtype:

>>> df = pd.DataFrame(data=d, dtype=np.int8)
>>> df.dtypes
col1    int8
col2    int8
dtype: object

Constructing DataFrame from a dictionary including Series:

>>> d = {'col1': [0, 1, 2, 3], 'col2': pd.Series([2, 3], index=[2, 3])}
>>> pd.DataFrame(data=d, index=[0, 1, 2, 3])
   col1  col2
0     0   NaN
1     1   NaN
2     2   2.0
3     3   3.0

Constructing DataFrame from numpy ndarray:

>>> df2 = pd.DataFrame(np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]),
...                    columns=['a', 'b', 'c'])
>>> df2
   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

Constructing DataFrame from a numpy ndarray that has labeled columns:

>>> data = np.array([(1, 2, 3), (4, 5, 6), (7, 8, 9)],
...                 dtype=[("a", "i4"), ("b", "i4"), ("c", "i4")])
>>> df3 = pd.DataFrame(data, columns=['c', 'a'])
...
>>> df3
   c  a
0  3  1
1  6  4
2  9  7

Constructing DataFrame from dataclass:

>>> from dataclasses import make_dataclass
>>> Point = make_dataclass("Point", [("x", int), ("y", int)])
>>> pd.DataFrame([Point(0, 0), Point(0, 3), Point(2, 3)])
   x  y
0  0  0
1  0  3
2  2  3

Constructing DataFrame from Series/DataFrame:

>>> ser = pd.Series([1, 2, 3], index=["a", "b", "c"])
>>> df = pd.DataFrame(data=ser, index=["a", "c"])
>>> df
   0
a  1
c  3

>>> df1 = pd.DataFrame([1, 2, 3], index=["a", "b", "c"], columns=["x"])
>>> df2 = pd.DataFrame(data=df1, index=["a", "c"])
>>> df2
   x
a  1
c  3
File:           c:\users\fadhl\appdata\local\programs\python\python312\lib\site-packages\pandas\core\frame.py
Type:           type
Subclasses:     SubclassedDataFrame

In [27]:
d1=pd.DataFrame(data= [[4,7,2],[1,8,3],[0,2,1]],
             columns=['A','B','C'])
d1

   A  B  C
0  4  7  2
1  1  8  3
2  0  2  1

In [28]:
d1['B']

0    7
1    8
2    2
Name: B, dtype: int64

In [29]:
d1[['B']]

   B
0  7
1  8
2  2

In [30]:
d1[['A','C']]

   A  C
0  4  2
1  1  3
2  0  1

In [31]:
d1.iloc[0:2]

   A  B  C
0  4  7  2
1  1  8  3

In [32]:
d1.loc[0:2]

   A  B  C
0  4  7  2
1  1  8  3
2  0  2  1

In [33]:
d1.iloc[0:2,[0]]

   A
0  4
1  1

In [34]:
d1.loc[0:2, ['A']]

   A
0  4
1  1
2  0

In [35]:
d1.loc[0:2, 'A':'B']

   A  B
0  4  7
1  1  8
2  0  2

In [36]:
# adding a new column to a dataframe
d1['D']=[5,6,0]
d1

   A  B  C  D
0  4  7  2  5
1  1  8  3  6
2  0  2  1  0

In [37]:
# changing the data of column
d1['C']= d1['C']*3
d1

   A  B  C  D
0  4  7  6  5
1  1  8  9  6
2  0  2  3  0

In [38]:
[d1>10]

[       A      B      C      D
 0  False  False  False  False
 1  False  False  False  False
 2  False  False  False  False]

In [39]:
d1[d1>10]

    A   B   C   D
0 NaN NaN NaN NaN
1 NaN NaN NaN NaN
2 NaN NaN NaN NaN

In [40]:
d1.loc[d1['B']> 10, ['A','C']]

Empty DataFrame
Columns: [A, C]
Index: []

In [41]:
pd.DataFrame(data = randn(5,4))

          0         1         2         3
0 -0.319318 -0.848077  0.605965 -2.018168
1  0.740122  0.528813 -0.589001  0.188695
2 -0.758872 -0.933237  0.955057  0.190794
3  1.978757  2.605967  0.683509  0.302665
4  1.693723 -1.706086 -1.159119 -0.134841

In [42]:
'A B C D E'.split()
#'A-B-C-D-E'.split('-')

['A', 'B', 'C', 'D', 'E']

In [43]:
#randn will give us random numbers from the standard noraml distribution in the shape specified
df = pd.DataFrame(randn(5,4),index=['A','B','C','D','E'],columns='W X Y Z'.split())

In [44]:
df

          W         X         Y         Z
A  0.390528  0.166905  0.184502  0.807706
B  0.072960  0.638787  0.329646 -0.497104
C -0.754070 -0.943406  0.484752 -0.116773
D  1.901755  0.238127  1.996652 -0.993263
E  0.196800 -1.136645  0.000366  1.025984

## Selection and Indexing

Let us consider the various methods to grab data from a DataFrame:

In [45]:
df['W']

A    0.390528
B    0.072960
C   -0.754070
D    1.901755
E    0.196800
Name: W, dtype: float64

In [46]:
df[['W']]

          W
A  0.390528
B  0.072960
C -0.754070
D  1.901755
E  0.196800

In [47]:
## to return a dataframe, you have to pass in a list of column names:

df[['W','Z']]

          W         Z
A  0.390528  0.807706
B  0.072960 -0.497104
C -0.754070 -0.116773
D  1.901755 -0.993263
E  0.196800  1.025984

In [48]:
## Dataframe columns are themselves Pandas series, you can confirm this by doing:

type(df['Y'])

pandas.core.series.Series

In [49]:
df

          W         X         Y         Z
A  0.390528  0.166905  0.184502  0.807706
B  0.072960  0.638787  0.329646 -0.497104
C -0.754070 -0.943406  0.484752 -0.116773
D  1.901755  0.238127  1.996652 -0.993263
E  0.196800 -1.136645  0.000366  1.025984

In [50]:
# you can create new columns in your dataframe:

df['NEW'] = df['X'] + df['Y']
df

          W         X         Y         Z       NEW
A  0.390528  0.166905  0.184502  0.807706  0.351406
B  0.072960  0.638787  0.329646 -0.497104  0.968433
C -0.754070 -0.943406  0.484752 -0.116773 -0.458655
D  1.901755  0.238127  1.996652 -0.993263  2.234779
E  0.196800 -1.136645  0.000366  1.025984 -1.136278

In [51]:
df.drop?

Signature:
df.drop(
    labels: 'IndexLabel | None' = None,
    *,
    axis: 'Axis' = 0,
    index: 'IndexLabel | None' = None,
    columns: 'IndexLabel | None' = None,
    level: 'Level | None' = None,
    inplace: 'bool' = False,
    errors: 'IgnoreRaise' = 'raise',
) -> 'DataFrame | None'
Docstring:
Drop specified labels from rows or columns.

Remove rows or columns by specifying label names and corresponding
axis, or by directly specifying index or column names. When using a
multi-index, labels on different levels can be removed by specifying
the level. See the :ref:`user guide <advanced.shown_levels>`
for more information about the now unused levels.

Parameters
----------
labels : single label or list-like
    Index or column labels to drop. A tuple will be used as a single
    label and not treated as a list-like.
axis : {0 or 'index', 1 or 'columns'}, default 0
    Whether to drop labels from the index (0 or 'index') or
    columns (1 or 'columns').
index : single label or list-like
    Alternative to specifying axis (``labels, axis=0``
    is equivalent to ``index=labels``).
columns : single label or list-like
    Alternative to specifying axis (``labels, axis=1``
    is equivalent to ``columns=labels``).
level : int or level name, optional
    For MultiIndex, level from which the labels will be removed.
inplace : bool, default False
    If False, return a copy. Otherwise, do operation
    in place and return None.
errors : {'ignore', 'raise'}, default 'raise'
    If 'ignore', suppress error and only existing labels are
    dropped.

Returns
-------
DataFrame or None
    Returns DataFrame or None DataFrame with the specified
    index or column labels removed or None if inplace=True.

Raises
------
KeyError
    If any of the labels is not found in the selected axis.

See Also
--------
DataFrame.loc : Label-location based indexer for selection by label.
DataFrame.dropna : Return DataFrame with labels on given axis omitted
    where (all or any) data are missing.
DataFrame.drop_duplicates : Return DataFrame with duplicate rows
    removed, optionally only considering certain columns.
Series.drop : Return Series with specified index labels removed.

Examples
--------
>>> df = pd.DataFrame(np.arange(12).reshape(3, 4),
...                   columns=['A', 'B', 'C', 'D'])
>>> df
   A  B   C   D
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

Drop columns

>>> df.drop(['B', 'C'], axis=1)
   A   D
0  0   3
1  4   7
2  8  11

>>> df.drop(columns=['B', 'C'])
   A   D
0  0   3
1  4   7
2  8  11

Drop a row by index

>>> df.drop([0, 1])
   A  B   C   D
2  8  9  10  11

Drop columns and/or rows of MultiIndex DataFrame

>>> midx = pd.MultiIndex(levels=[['llama', 'cow', 'falcon'],
...                              ['speed', 'weight', 'length']],
...                      codes=[[0, 0, 0, 1, 1, 1, 2, 2, 2],
...                             [0, 1, 2, 0, 1, 2, 0, 1, 2]])
>>> df = pd.DataFrame(index=midx, columns=['big', 'small'],
...                   data=[[45, 30], [200, 100], [1.5, 1], [30, 20],
...                         [250, 150], [1.5, 0.8], [320, 250],
...                         [1, 0.8], [0.3, 0.2]])
>>> df
                big     small
llama   speed   45.0    30.0
        weight  200.0   100.0
        length  1.5     1.0
cow     speed   30.0    20.0
        weight  250.0   150.0
        length  1.5     0.8
falcon  speed   320.0   250.0
        weight  1.0     0.8
        length  0.3     0.2

Drop a specific index combination from the MultiIndex
DataFrame, i.e., drop the combination ``'falcon'`` and
``'weight'``, which deletes only the corresponding row

>>> df.drop(index=('falcon', 'weight'))
                big     small
llama   speed   45.0    30.0
        weight  200.0   100.0
        length  1.5     1.0
cow     speed   30.0    20.0
        weight  250.0   150.0
        length  1.5     0.8
falcon  speed   320.0   250.0
        length  0.3     0.2

>>> df.drop(index='cow', columns='small')
                big
llama   speed   45.0
        weight  200.0
        length  1.5
falcon  speed   320.0
        weight  1.0
        length  0.3

>>> df.drop(index='length', level=1)
                big     small
llama   speed   45.0    30.0
        weight  200.0   100.0
cow     speed   30.0    20.0
        weight  250.0   150.0
falcon  speed   320.0   250.0
        weight  1.0     0.8
File:      c:\users\fadhl\appdata\local\programs\python\python312\lib\site-packages\pandas\core\frame.py
Type:      method

In [52]:
# you can also remove existing columns from the dataframe:
df.drop('NEW', axis = 1)

          W         X         Y         Z
A  0.390528  0.166905  0.184502  0.807706
B  0.072960  0.638787  0.329646 -0.497104
C -0.754070 -0.943406  0.484752 -0.116773
D  1.901755  0.238127  1.996652 -0.993263
E  0.196800 -1.136645  0.000366  1.025984

In [53]:
## you may need to explicitly indicate that a column should be permanently dropped
df

          W         X         Y         Z       NEW
A  0.390528  0.166905  0.184502  0.807706  0.351406
B  0.072960  0.638787  0.329646 -0.497104  0.968433
C -0.754070 -0.943406  0.484752 -0.116773 -0.458655
D  1.901755  0.238127  1.996652 -0.993263  2.234779
E  0.196800 -1.136645  0.000366  1.025984 -1.136278

In [54]:
df2 =df.drop('NEW',axis=1)
df2

          W         X         Y         Z
A  0.390528  0.166905  0.184502  0.807706
B  0.072960  0.638787  0.329646 -0.497104
C -0.754070 -0.943406  0.484752 -0.116773
D  1.901755  0.238127  1.996652 -0.993263
E  0.196800 -1.136645  0.000366  1.025984

In [55]:
df.drop('NEW',axis=1,inplace=True)

In [56]:
df

          W         X         Y         Z
A  0.390528  0.166905  0.184502  0.807706
B  0.072960  0.638787  0.329646 -0.497104
C -0.754070 -0.943406  0.484752 -0.116773
D  1.901755  0.238127  1.996652 -0.993263
E  0.196800 -1.136645  0.000366  1.025984

In [57]:
df['X'] = df['X'] **2
df

          W         X         Y         Z
A  0.390528  0.027857  0.184502  0.807706
B  0.072960  0.408049  0.329646 -0.497104
C -0.754070  0.890016  0.484752 -0.116773
D  1.901755  0.056704  1.996652 -0.993263
E  0.196800  1.291961  0.000366  1.025984

In [58]:
new_values = np.random.randint(10, size = 5)
new_values

array([4, 5, 9, 5, 8])

In [59]:
df['W'] = new_values
df

   W         X         Y         Z
A  4  0.027857  0.184502  0.807706
B  5  0.408049  0.329646 -0.497104
C  9  0.890016  0.484752 -0.116773
D  5  0.056704  1.996652 -0.993263
E  8  1.291961  0.000366  1.025984

In [60]:
## you can also select rows
df.loc['D']

W    5.000000
X    0.056704
Y    1.996652
Z   -0.993263
Name: D, dtype: float64

In [61]:
## you can select rows based on index number
df.iloc[3]

W    5.000000
X    0.056704
Y    1.996652
Z   -0.993263
Name: D, dtype: float64

In [62]:
df.iloc[-2]

W    5.000000
X    0.056704
Y    1.996652
Z   -0.993263
Name: D, dtype: float64

In [63]:
## you can select a subset of rows and columns. It will give you entries where rows and columns intersect
#df.loc['E','Z']
df.loc['E']['Z']

1.025984152081572

In [64]:
df.loc[['A','E'],['W','Z']]

   W         Z
A  4  0.807706
E  8  1.025984

In [65]:
df.loc['B':'D','X':'Z']

          X         Y         Z
B  0.408049  0.329646 -0.497104
C  0.890016  0.484752 -0.116773
D  0.056704  1.996652 -0.993263

In [66]:
df.iloc[[1,3], [0,2]]

   W         Y
B  5  0.329646
D  5  1.996652

In [67]:
df.iloc[0:3, :]

   W         X         Y         Z
A  4  0.027857  0.184502  0.807706
B  5  0.408049  0.329646 -0.497104
C  9  0.890016  0.484752 -0.116773

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [68]:
df

   W         X         Y         Z
A  4  0.027857  0.184502  0.807706
B  5  0.408049  0.329646 -0.497104
C  9  0.890016  0.484752 -0.116773
D  5  0.056704  1.996652 -0.993263
E  8  1.291961  0.000366  1.025984

In [69]:
df>0

      W     X     Y      Z
A  True  True  True   True
B  True  True  True  False
C  True  True  True  False
D  True  True  True  False
E  True  True  True   True

In [70]:
df[df>0]

   W         X         Y         Z
A  4  0.027857  0.184502  0.807706
B  5  0.408049  0.329646       NaN
C  9  0.890016  0.484752       NaN
D  5  0.056704  1.996652       NaN
E  8  1.291961  0.000366  1.025984

In [71]:
# The bracket helps us to return actual values and not just boolean logic
df[df>0]

   W         X         Y         Z
A  4  0.027857  0.184502  0.807706
B  5  0.408049  0.329646       NaN
C  9  0.890016  0.484752       NaN
D  5  0.056704  1.996652       NaN
E  8  1.291961  0.000366  1.025984

In [72]:
df[df['Z']>0]

   W         X         Y         Z
A  4  0.027857  0.184502  0.807706
E  8  1.291961  0.000366  1.025984

In [73]:
#here we are doing conditional selection of values in a column X based on values in column W meeting a condition
df[df['W']>0][['X']]

          X
A  0.027857
B  0.408049
C  0.890016
D  0.056704
E  1.291961

In [74]:
d = df[df['W']>0]
d['X']

A    0.027857
B    0.408049
C    0.890016
D    0.056704
E    1.291961
Name: X, dtype: float64

In [75]:
#This is similar to above. Here we are selecting columns Y and X
df[df['W']>0][['Y','X']]

          Y         X
A  0.184502  0.027857
B  0.329646  0.408049
C  0.484752  0.890016
D  1.996652  0.056704
E  0.000366  1.291961

In [76]:
## when you need to select with two conditionals, you can use | or &
df[(df['W']>0) & (df['Y'] > 1)]

   W         X         Y         Z
D  5  0.056704  1.996652 -0.993263

In [77]:
df[(df['W']>0) | (df['Y'] > 1)]

   W         X         Y         Z
A  4  0.027857  0.184502  0.807706
B  5  0.408049  0.329646 -0.497104
C  9  0.890016  0.484752 -0.116773
D  5  0.056704  1.996652 -0.993263
E  8  1.291961  0.000366  1.025984

In [78]:
## you can also reset index to the default of 0,1,2...n
df3 = df.reset_index()
df3

  index  W         X         Y         Z
0     A  4  0.027857  0.184502  0.807706
1     B  5  0.408049  0.329646 -0.497104
2     C  9  0.890016  0.484752 -0.116773
3     D  5  0.056704  1.996652 -0.993263
4     E  8  1.291961  0.000366  1.025984

In [79]:
df3 = df.reset_index(drop = True)
df3

   W         X         Y         Z
0  4  0.027857  0.184502  0.807706
1  5  0.408049  0.329646 -0.497104
2  9  0.890016  0.484752 -0.116773
3  5  0.056704  1.996652 -0.993263
4  8  1.291961  0.000366  1.025984

In [80]:
countries = 'USA GER RUS UK FRA'.split()
df['COUNTRY']= countries
df

   W         X         Y         Z COUNTRY
A  4  0.027857  0.184502  0.807706     USA
B  5  0.408049  0.329646 -0.497104     GER
C  9  0.890016  0.484752 -0.116773     RUS
D  5  0.056704  1.996652 -0.993263      UK
E  8  1.291961  0.000366  1.025984     FRA

In [81]:
df4 = df.set_index('COUNTRY')
#df.set_index('COUNTRY', inplace = TRUE)

In [82]:
df4

         W         X         Y         Z
COUNTRY
USA      4  0.027857  0.184502  0.807706
GER      5  0.408049  0.329646 -0.497104
RUS      9  0.890016  0.484752 -0.116773
UK       5  0.056704  1.996652 -0.993263
FRA      8  1.291961  0.000366  1.025984

In [83]:
df4.loc['GER',['X', 'Y']]

X    0.408049
Y    0.329646
Name: GER, dtype: float64

In [84]:
## remember to make inplace True to keep the change permanently

In [85]:
df.set_index('COUNTRY',inplace=True)

In [86]:
df

         W         X         Y         Z
COUNTRY
USA      4  0.027857  0.184502  0.807706
GER      5  0.408049  0.329646 -0.497104
RUS      9  0.890016  0.484752 -0.116773
UK       5  0.056704  1.996652 -0.993263
FRA      8  1.291961  0.000366  1.025984

## Multi-Level Index and Index Hierarchy

Pandas also allows multi level indexing and index hierarchy:

In [87]:
# Index Levels
level_1 = ['J1','J1','J1','J2','J2','J2']
level_2 = [1,2,3,1,2,3]

In [88]:
list(zip(level_1, level_2))

[('J1', 1), ('J1', 2), ('J1', 3), ('J2', 1), ('J2', 2), ('J2', 3)]

In [89]:
hier_index = list(zip(level_1,level_2))
hier_index

[('J1', 1), ('J1', 2), ('J1', 3), ('J2', 1), ('J2', 2), ('J2', 3)]

In [90]:
hier_index = pd.MultiIndex.from_tuples(hier_index)
hier_index

MultiIndex([('J1', 1),
            ('J1', 2),
            ('J1', 3),
            ('J2', 1),
            ('J2', 2),
            ('J2', 3)],
           )

In [91]:
# here we set the index to the hierarchical index we have created 
new_df = pd.DataFrame(np.random.randn(6,3),index=hier_index,columns=['A','B','C'])
new_df

             A         B         C
J1 1 -0.156598  0.050221  1.556790
   2  1.345434  1.501737 -0.633348
   3 -0.487281 -1.647469  0.543758
J2 1 -1.210949 -0.365949  0.632181
   2 -0.393214 -1.826066  1.257824
   3  1.291497 -0.200139  1.255905

Now let's look at how to index this. For index hierarchy we use df.loc[], if this was on the columns axis, you would just use normal bracket notation df[]. Calling one level of the index returns the sub-dataframe:

In [92]:
new_df.loc['J1']

          A         B         C
1 -0.156598  0.050221  1.556790
2  1.345434  1.501737 -0.633348
3 -0.487281 -1.647469  0.543758

In [93]:
new_df.loc['J1'].loc[1]

A   -0.156598
B    0.050221
C    1.556790
Name: 1, dtype: float64

In [94]:
# we are creating index names for the two index levels
new_df.index.names= ['Group','Number']

In [95]:
new_df

                     A         B         C
Group Number
J1    1      -0.156598  0.050221  1.556790
      2       1.345434  1.501737 -0.633348
      3      -0.487281 -1.647469  0.543758
J2    1      -1.210949 -0.365949  0.632181
      2      -0.393214 -1.826066  1.257824
      3       1.291497 -0.200139  1.255905

In [96]:
# the function xs helps us to slice through 1 or more levels of index at one. We can specify argument level and put in index level name
new_df.xs('J1')

               A         B         C
Number
1      -0.156598  0.050221  1.556790
2       1.345434  1.501737 -0.633348
3      -0.487281 -1.647469  0.543758

In [97]:
new_df.xs(1,level='Number')

              A         B         C
Group
J1    -0.156598  0.050221  1.556790
J2    -1.210949 -0.365949  0.632181

In [98]:
new_df.xs(3,level='Number')

              A         B         C
Group
J1    -0.487281 -1.647469  0.543758
J2     1.291497 -0.200139  1.255905